app/controllers/bus_controller.rb

SELECT * FROM `currencies`
---
  def index
    @currencies = Currency.all()