app/controllers/hop_controller.rb

SELECT * FROM `hops` WHERE (`hops`.`facebook_id` = '100000201256691' AND `hops`.`bus_id` = '1') ORDER BY hops.id DESC LIMIT 1
INSERT INTO `hops` (`facebook_id`, `bus_owner_facebook_id`, `created_date`, `amount`, `bus_id`, `comment`) VALUES('632818246', 632818246, '2011-01-08 12:17:47', 1.23, 1, '')
---
  def index
    @show_wait_message = false
    @wait_time = 0
    # Try to get last hop
    @new_hop = Hop.last(:conditions=>{:facebook_id=>$facebook.user_id,:bus_id=>params[:bus_id]})
    if @new_hop.nil?
      interval_time = (3600) + 1
    else
      interval_time = Time.now - @new_hop.created_date

UPDATE `hops` SET `comment` = 'ertherh' WHERE `id` = 1
---
  def save
    @new_hop = Hop.first(:conditions=>{:id => params[:hop_id]})
    @new_hop.comment = params[:comment]
    if !@new_hop.save